{
  "_name_or_path": "hf-internal-testing/tiny-random-MistralForCausalLM",
  "architectures": [
    "MistralForCausalLM"
  ],
  "attention_dropout": 0.0,
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "head_dim": 8,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 32,
  "index_k": 2,
  "initializer_range": 0.02,
  "intermediate_size": 37,
  "is_decoder": true,
  "max_position_embeddings": 512,
  "model_type": "mistral",
  "num_attention_heads": 4,
  "num_hidden_layers": 2,
  "num_key_value_heads": 2,
  "pad_token_id": 0,
  "r_value": 64,
  "rms_norm_eps": 1e-06,
  "rope_theta": 10000.0,
  "sequence_length": 2048,
  "sliding_window": 4096,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.43.1",
  "type_vocab_size": 16,
  "use_cache": true,
  "vocab_size": 32000
}
